*Pandas series yapısı vardır indisler ile beraber verileri verir indisleri biz belirleyebiliriz.

In [1]:
import numpy as np
import pandas as pd

** Bir sözlük oluşturlım ve bunu serilere dönüştürelim.

In [2]:
myDictionary={'irem':21,'Nazlı':13,'Hakan':30,'Sude':20}

In [5]:
myDictionary

{'irem': 21, 'Nazlı': 13, 'Hakan': 30, 'Sude': 20}

In [6]:
mySeries=pd.Series(myDictionary)

In [7]:
mySeries

irem     21
Nazlı    13
Hakan    30
Sude     20
dtype: int64

** Şimdide bir liste oluşturalım ve onu serilere dönüştürelim.

In [11]:
myList=[100,200,300,400,500,600]

In [12]:
myList

[100, 200, 300, 400, 500, 600]

In [13]:
myListSeries=pd.Series(myList)

In [14]:
myListSeries

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [15]:
myListPrice=["Çanta","Ayakkabı","Sweet","Pantolon","Şapka","Takı"]

In [18]:
myWholeSeries=pd.Series(data=myList,index=myListPrice)

** Yukarıda parantez içine data ve index ile eşitlenmeyebilirdi.(myList,MyListPrice)

In [20]:
myWholeSeries

Çanta       100
Ayakkabı    200
Sweet       300
Pantolon    400
Şapka       500
Takı        600
dtype: int64

** Serileri kendi aralarında toplayabiliriz.

In [21]:
race1=pd.Series([10,5,6],["Ali","Ahmet","Mehmet"])

In [22]:
race2=pd.Series([8,7,7],["Ali","Ahmet","Mehmet"])

In [23]:
endResault=race1+race2

In [24]:
endResault

Ali       18
Ahmet     12
Mehmet    13
dtype: int64

** Peki iki seri tam eşleşemeseydi?

In [26]:
schoolPoint1=pd.Series([100,75,84],["Ali","Ahmet","Zeynep"])

In [28]:
schoolPoint2=pd.Series([100,98,96],["Ali","Zeynep","Fatma"])

In [29]:
schoolPoint1

Ali       100
Ahmet      75
Zeynep     84
dtype: int64

In [30]:
schoolPoint2

Ali       100
Zeynep     98
Fatma      96
dtype: int64

In [31]:
pointResault=schoolPoint2+schoolPoint1

In [32]:
pointResault

Ahmet       NaN
Ali       200.0
Fatma       NaN
Zeynep    182.0
dtype: float64

** Sonuç olarak her iki listede de ortak olanları topladı diğerlerine nan döndürdü.

## DataFrame

** Serilerin yan yana gelerek oluşturduğu bir excel tablosu olarak düşünülebilir.

** (4,3) lük bir matris oluşturmak için numpy kütüphanesini kullanıcam.

In [37]:
data=np.random.randn(4,3)

In [34]:
data

array([[-1.01584639,  1.24330472, -0.04008596],
       [ 1.02407343, -0.00676416,  0.35209661],
       [-3.16912145,  1.02619356,  2.41090789],
       [-0.54702272, -0.29219994, -0.37399285]])

** Şimdi bu data yı bir excel tablosunda gibi göstericeğiz.

In [38]:
dataFrame=pd.DataFrame(data)

In [39]:
dataFrame

          0         1         2
0  2.060362 -0.371661  1.392296
1  0.919978 -0.934058 -1.891480
2 -0.164291  0.599067 -1.595310
3 -0.357909  2.616952  1.089889

In [40]:
dataFrame[0]

0    2.060362
1    0.919978
2   -0.164291
3   -0.357909
Name: 0, dtype: float64

** Bu şekilde 0. indisi istediğimizde bize sütundaki 0. indisin hepsini getirir.Peki 0.satırı istersek.

In [42]:
newDataFrame=pd.DataFrame(data,index=["Ali","Zeynep","Çağla","Nazım"],columns=["Maaş","Yaş","Tecrübe"])

In [43]:
newDataFrame

            Maaş       Yaş   Tecrübe
Ali     2.060362 -0.371661  1.392296
Zeynep  0.919978 -0.934058 -1.891480
Çağla  -0.164291  0.599067 -1.595310
Nazım  -0.357909  2.616952  1.089889

In [44]:
newDataFrame["Maaş"]

Ali       2.060362
Zeynep    0.919978
Çağla    -0.164291
Nazım    -0.357909
Name: Maaş, dtype: float64

In [47]:
newDataFrame.loc["Zeynep"]

Maaş       0.919978
Yaş       -0.934058
Tecrübe   -1.891480
Name: Zeynep, dtype: float64

** Aynı zamanda indeks numarasına görede çağırabilirsin.

In [48]:
newDataFrame.iloc[1]

Maaş       0.919978
Yaş       -0.934058
Tecrübe   -1.891480
Name: Zeynep, dtype: float64

** Yeni bir sütun eklemek istersek!!

In [49]:
newDataFrame["İkramiye"]=[100,200,300,400]

In [51]:
newDataFrame

            Maaş       Yaş   Tecrübe  İkramiye
Ali     2.060362 -0.371661  1.392296       100
Zeynep  0.919978 -0.934058 -1.891480       200
Çağla  -0.164291  0.599067 -1.595310       300
Nazım  -0.357909  2.616952  1.089889       400

** sütunu çıkarmak istersek.

In [52]:
newDataFrame.drop("İkramiye",axis=1)

            Maaş       Yaş   Tecrübe
Ali     2.060362 -0.371661  1.392296
Zeynep  0.919978 -0.934058 -1.891480
Çağla  -0.164291  0.599067 -1.595310
Nazım  -0.357909  2.616952  1.089889

** axis eksen demektir axis=0 olursa  satır ekseni demektir.
** axis=1 derse bu sütun ekseni demektir.

** Kalıcı değildir bu şekilde bu yüzden  "INPLACE" kullanmamız lazım.

In [54]:
newDataFrame

            Maaş       Yaş   Tecrübe  İkramiye
Ali     2.060362 -0.371661  1.392296       100
Zeynep  0.919978 -0.934058 -1.891480       200
Çağla  -0.164291  0.599067 -1.595310       300
Nazım  -0.357909  2.616952  1.089889       400

In [55]:
newDataFrame.drop("İkramiye",axis=1,inplace=True)

In [56]:
newDataFrame

            Maaş       Yaş   Tecrübe
Ali     2.060362 -0.371661  1.392296
Zeynep  0.919978 -0.934058 -1.891480
Çağla  -0.164291  0.599067 -1.595310
Nazım  -0.357909  2.616952  1.089889

** Artık kalıcı olarak silindi!

In [57]:
newDataFrame.loc["Ali"]["Maaş"]

2.060362017370175

In [58]:
newDataFrame.loc["Ali","Maaş"]

2.060362017370175

In [59]:
newDataFrame["Maaş"]["Ali"]

2.060362017370175

In [62]:
newDataFrame<-1

         Maaş    Yaş  Tecrübe
Ali     False  False    False
Zeynep  False  False     True
Çağla   False  False     True
Nazım   False  False    False

In [64]:
newDataFrame[newDataFrame<-1]

        Maaş  Yaş  Tecrübe
Ali      NaN  NaN      NaN
Zeynep   NaN  NaN -1.89148
Çağla    NaN  NaN -1.59531
Nazım    NaN  NaN      NaN

In [65]:
newDataFrame<0

         Maaş    Yaş  Tecrübe
Ali     False   True    False
Zeynep  False   True     True
Çağla    True  False     True
Nazım    True  False    False

In [66]:
newDataFrame[newDataFrame<0]

            Maaş       Yaş  Tecrübe
Ali          NaN -0.371661      NaN
Zeynep       NaN -0.934058 -1.89148
Çağla  -0.164291       NaN -1.59531
Nazım  -0.357909       NaN      NaN

In [69]:
boolKnowledge=newDataFrame["Yaş"]<0

In [70]:
newDataFrame[boolKnowledge]

            Maaş       Yaş   Tecrübe
Ali     2.060362 -0.371661  1.392296
Zeynep  0.919978 -0.934058 -1.891480

In [71]:
boolKnowledge2=newDataFrame["Maaş"]>2

In [72]:
newDataFrame[boolKnowledge2]

         Maaş       Yaş   Tecrübe
Ali  2.060362 -0.371661  1.392296